//.title
// ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
//
// 🇽🇾🇿 & Dev
//
// Copyright Ⓒ Robert Mollentze, xyzand.dev
//
// Licensing details can be found in the LICENSE file in the root directory.
//
// ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
//.title~

import 'package:xyz_gen/xyz_gen.dart';

// ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░

// To-Do: List the folders and their subfolders to generate exports for.
const folders = <String>{
  '',
  '_data',
  '_service_interfaces',
  '_services',
  '_view',
  'example_app',
  'admin_app',
  'operations_app',
  'public_app',
  'genie_app',
};

const subfolders = <String>{
  'lib/functions_src',
  'lib/src',
  'lib/src/non_web',
  'lib/src/web_friendly',
  'lib/shared_src',
  'lib/shared_src/non_web',
  'lib/shared_src/web_friendly',
};

// ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░
//
// DO NOT MODIFY BELOW
//
// ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░

void main() async {
  await generateExportsApp([
    '-t',
    '$currentScriptDir/templates/generate_exports/your_exports_template.dart.md',
    '-r',
    folders
        .map((e) => '$currentScriptDir/../${e.isNotEmpty ? '$e/' : ''}')
        .join('&'),
    '-s',
    subfolders.join('&'),
  ]);
}
